app/views/microposts/_micropost.html.erb

	</td>
	<% user = micropost.user rescue User.find(micropost.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1