app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ('Lorem ipsum dolor sit amet', 1, '2012-08-04 02:19:59.553300', '2012-08-04 02:19:59.553300')
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save