app/controllers/relationships_controller.rb

  def create
    @user = User.find(params[:relationship][:followed_id])
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 5 AND ("relationships".follower_id = 101) LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def destroy
    @user = Relationship.find(params[:id]).followed
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 2 AND ("relationships".follower_id = 1) LIMIT 1