app/controllers/users_controller.rb

  def index
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
  	@user = User.find(params[:id])
  	@microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def create
  	@user = User.new(params[:user])
  	if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('New User', 'user@example.com', '2012-08-04 02:20:01.227257', '2012-08-04 02:20:01.227257', '1b108bf171efbc0fef9e676f4fe2a2b5ff8052a1a99d87bede38787037f652fe', '141b2595e0cf09fe4bb63353654e17466a9961f9bf0fc0c182bdbfa274039c81', 'f')

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "encrypted_password" = '350d95ed987dbb216ab7b53d7445292f6783de939d70f57accd0b881d96e6167', "updated_at" = '2012-08-04 02:20:01.478684' WHERE "users"."id" = 1